"%[All]@ of the following are true" = "%1$[All]@ of the following are true";
"%[Any]@ of the following are true" = "%1$[Any]@ of the following are true";
"%[None]@ of the following are true" = "%1$[None]@ of the following are true";

"%[File Name]@ %[contains]@ %@" = "%1$[File Name]@ %2$[contains]@ %3$@";
"%[File Name]@ %[begins with]@ %@" = "%1$[File Name]@ %2$[begins with]@ %3$@";
"%[File Name]@ %[ends with]@ %@" = "%1$[File Name]@ %2$[ends with]@ %3$@";
"%[File Name]@ %[is]@ %@" = "%1$[File Name]@ %2$[is]@ %3$@";
"%[File Name]@ %[is not]@ %@" = "%1$[File Name]@ %2$[is not]@ %3$@";
"%[File Name]@ %[matches]@ %@" = "%1$[File Name]@ %2$[matches]@ %3$@";

"%[File Type]@ %[contains]@ %@" = "%1$[File Type]@ %2$[contains]@ %3$@";
"%[File Type]@ %[begins with]@ %@" = "%1$[File Type]@ %2$[begins with]@ %3$@";
"%[File Type]@ %[ends with]@ %@" = "%1$[File Type]@ %2$[ends with]@ %3$@";
"%[File Type]@ %[is]@ %@" = "%1$[File Type]@ %2$[is]@ %3$@";
"%[File Type]@ %[is not]@ %@" = "%1$[File Type]@ %2$[is not]@ %3$@";
"%[File Type]@ %[matches]@ %@" = "%1$[File Type]@ %2$[matches]@ %3$@";

"%[File Label]@ contains %@" = "%1$[File Label]@ contains %2$@";


"%[File layout needs to be checked]@" = "%1$[File layout needs to be checked]@";

"%[File added during last update]@" = "%1$[File added during last update]@";

"%[File updated during last update]@" = "%1$[File updated during last update]@";

"%[File has inconsistencies]@" = "%1$[File has inconsistencies]@";

"%[File does not exist on the disk]@" = "%1$[File does not exist on the disk]@";


"%[String Value]@ %[contains]@ %@" = "%1$[String Value]@ %2$[contains]@ %3$@";
"%[String Value]@ %[begins with]@ %@" = "%1$[String Value]@ %2$[begins with]@ %3$@";
"%[String Value]@ %[ends with]@ %@" = "%1$[String Value]@ %2$[ends with]@ %3$@";
"%[String Value]@ %[is]@ %@" = "%1$[String Value]@ %2$[is]@ %3$@";
"%[String Value]@ %[is not]@ %@" = "%1$[String Value]@ %2$[is not]@ %3$@";
"%[String Value]@ %[matches]@ %@" = "%1$[String Value]@ %2$[matches]@ %3$@";

"%[String Base Value]@ %[contains]@ %@" = "%1$[String Base Value]@ %2$[contains]@ %3$@";
"%[String Base Value]@ %[begins with]@ %@" = "%1$[String Base Value]@ %2$[begins with]@ %3$@";
"%[String Base Value]@ %[ends with]@ %@" = "%1$[String Base Value]@ %2$[ends with]@ %3$@";
"%[String Base Value]@ %[is]@ %@" = "%1$[String Base Value]@ %2$[is]@ %3$@";
"%[String Base Value]@ %[is not]@ %@" = "%1$[String Base Value]@ %2$[is not]@ %3$@";
"%[String Base Value]@ %[matches]@ %@" = "%1$[String Base Value]@ %2$[matches]@ %3$@";

"%[String Comment]@ %[contains]@ %@" = "%1$[String Comment]@ %2$[contains]@ %3$@";
"%[String Comment]@ %[begins with]@ %@" = "%1$[String Comment]@ %2$[begins with]@ %3$@";
"%[String Comment]@ %[ends with]@ %@" = "%1$[String Comment]@ %2$[ends with]@ %3$@";
"%[String Comment]@ %[is]@ %@" = "%1$[String Comment]@ %2$[is]@ %3$@";
"%[String Comment]@ %[is not]@ %@" = "%1$[String Comment]@ %2$[is not]@ %3$@";
"%[String Comment]@ %[matches]@ %@" = "%1$[String Comment]@ %2$[matches]@ %3$@";

"%[String Base Comment]@ %[contains]@ %@" = "%1$[String Base Comment]@ %2$[contains]@ %3$@";
"%[String Base Comment]@ %[begins with]@ %@" = "%1$[String Base Comment]@ %2$[begins with]@ %3$@";
"%[String Base Comment]@ %[ends with]@ %@" = "%1$[String Base Comment]@ %2$[ends with]@ %3$@";
"%[String Base Comment]@ %[is]@ %@" = "%1$[String Base Comment]@ %2$[is]@ %3$@";
"%[String Base Comment]@ %[is not]@ %@" = "%1$[String Base Comment]@ %2$[is not]@ %3$@";
"%[String Base Comment]@ %[matches]@ %@" = "%1$[String Base Comment]@ %2$[matches]@ %3$@";

"%[String Label]@ contains %@" = "%1$[String Label]@ contains %2$@";


"%[String is not translated]@" = "%1$[String is not translated]@";

"%[String is translated]@" = "%1$[String is translated]@";

"%[String needs to be checked]@" = "%1$[String needs to be checked]@";

"%[String is an invariant]@" = "%1$[String is an invariant]@";

"%[String has base modified]@" = "%1$[String has base modified]@";

"%[String has inconsistencies]@" = "%1$[String has inconsistencies]@";

"%[String is locked]@" = "%1$[String is locked]@";
